[M_UncleTeddy MissionDefinition]
MissionDescription="A woman named Una has asked you to help her avenge her uncle, Teddy, who lived in [place]Fyrestone[-place]. Teddy, a weapons inventor, was exiled to Pandora after Hyperion stole his weapon designs. If you can find proof of Hyperion's patent theft, Una can sue the pants off them. Metaphorically. "
TurnInDescription="You uncovered the history of T.K. Baha -- gone, but not forgotten."

[M_UncleTeddy:UncleTeddy_FindBluePrint MissionObjectiveDefinition]
ProgressMessage="Pick up T.K.'s blueprint"
